; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v1 ?v13)
             (pred_7 ?v9 ?v6)
             (pred_11 ?v1 ?v6)
             (pred_5 ?v2 ?v1 )
	     (pred_10 ?v1)
             (pred_2 ?v5)
             (pred_1 ?v9)
             (pred_9 ?v6)
             (pred_3 ?v1)
             (pred_8 ?v9)
             (pred_4 ?v1)
             (pred_12 ))



(:action op_3
:parameters (?v7 ?v3 ?v8 ?v11)
:precondition (and (pred_2 ?v7) (pred_2 ?v3) (pred_1 ?v8) (pred_9 ?v11)
          (pred_6 ?v7 ?v3) (pred_7 ?v8 ?v11)
                   (pred_11 ?v3 ?v11) (pred_10 ?v7) 
                   (pred_3 ?v3) (pred_8 ?v8))
:effect (and  (pred_4 ?v3) (not (pred_3 ?v3))))


(:action op_2
:parameters (?v7 ?v4)
:precondition (and (pred_2 ?v7) (pred_2 ?v4)
               (pred_10 ?v7) (pred_6 ?v7 ?v4) (pred_4 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v7))))

(:action op_4
:parameters (?v7 ?v8)
:precondition (and (pred_2 ?v7) (pred_1 ?v8) 
                  (pred_10 ?v7) (pred_5 ?v8 ?v7) (pred_12 ))
:effect (and (pred_8 ?v8)
   (not (pred_5 ?v8 ?v7)) (not (pred_12 ))))


(:action op_1
:parameters (?v7 ?v12 ?v10)
:precondition (and (pred_2 ?v7) (pred_1 ?v12) (pred_1 ?v10)
                  (pred_10 ?v7) (pred_8 ?v10) (pred_5 ?v12 ?v7))
:effect (and (pred_8 ?v12) (pred_5 ?v10 ?v7)
        (not (pred_8 ?v10)) (not (pred_5 ?v12 ?v7))))

(:action op_5
:parameters (?v7 ?v8)
:precondition (and (pred_2 ?v7) (pred_1 ?v8) 
                  (pred_10 ?v7) (pred_8 ?v8))
:effect (and (pred_12 ) (pred_5 ?v8 ?v7) (not (pred_8 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_30 obj_26 obj_09 obj_05 obj_20 obj_22 obj_25 obj_21 obj_04 obj_13 obj_29 obj_16 obj_10 obj_27 obj_15 obj_02 obj_11 obj_24 obj_07 obj_19 obj_14 obj_06 obj_31 obj_23
    obj_28 obj_08 obj_17
    obj_12 obj_03 obj_18
    )

    (:init
       (pred_12)

       (pred_2 obj_01)
       (pred_2 obj_30)
       (pred_2 obj_26)
       (pred_2 obj_09)
       (pred_2 obj_05)
       (pred_2 obj_20)
       (pred_2 obj_22)
       (pred_2 obj_25)
       (pred_2 obj_21)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_2 obj_29)
       (pred_2 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_27)
       (pred_2 obj_15)
       (pred_2 obj_02)
       (pred_2 obj_11)
       (pred_2 obj_24)
       (pred_2 obj_07)
       (pred_2 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_31)
       (pred_2 obj_23)
       (pred_9 obj_28)
       (pred_9 obj_08)
       (pred_9 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_03)
       (pred_1 obj_18)

       (pred_6 obj_01 obj_20)
       (pred_6 obj_01 obj_30)
       (pred_6 obj_30 obj_22)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_30 obj_01)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_09)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_26)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_20 obj_01)
       (pred_6 obj_22 obj_29)
       (pred_6 obj_22 obj_25)
       (pred_6 obj_22 obj_30)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_25 obj_16)
       (pred_6 obj_25 obj_21)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_25 obj_22)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_04 obj_27)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_13 obj_29)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_29 obj_02)
       (pred_6 obj_29 obj_16)
       (pred_6 obj_29 obj_22)
       (pred_6 obj_29 obj_13)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_25)
       (pred_6 obj_16 obj_29)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_10 obj_27)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_27 obj_07)
       (pred_6 obj_27 obj_04)
       (pred_6 obj_27 obj_10)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_11 obj_24)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_24 obj_31)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_11)
       (pred_6 obj_07 obj_23)
       (pred_6 obj_07 obj_27)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_06 obj_31)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_31 obj_24)
       (pred_6 obj_31 obj_06)
       (pred_6 obj_23 obj_07)
       (pred_6 obj_23 obj_31)
       (pred_3 obj_30)
       (pred_3 obj_14)
       (pred_3 obj_15)
       (pred_11  obj_30 obj_28)
       (pred_11  obj_14 obj_08)
       (pred_11  obj_15 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_26)
       (pred_4 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_20)
       (pred_4 obj_22)
       (pred_4 obj_25)
       (pred_4 obj_21)
       (pred_4 obj_04)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_27)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_24)
       (pred_4 obj_07)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_31)
       (pred_4 obj_23)

       (pred_7  obj_12 obj_28)
       (pred_7  obj_03 obj_08)
       (pred_7  obj_18 obj_17)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_18 obj_27)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_5 obj_03 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_24)))
)
)

; plan
1. (op_2 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 0 of 1
2. (op_2 obj_11 obj_06)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_06)
   goals met: 0 of 1
3. (op_2 obj_06 obj_31)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_31)
   goals met: 0 of 1
4. (op_2 obj_31 obj_23)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_23)
   goals met: 0 of 1
5. (op_2 obj_23 obj_07)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_07)
   goals met: 0 of 1
6. (op_4 obj_07 obj_03)
   deleted: (pred_5 obj_03 obj_07) (pred_12)
   added: (pred_8 obj_03)
   goals met: 0 of 1
7. (op_2 obj_07 obj_27)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_27)
   goals met: 0 of 1
8. (op_2 obj_27 obj_10)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_10)
   goals met: 0 of 1
9. (op_2 obj_10 obj_16)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_16)
   goals met: 0 of 1
10. (op_2 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 0 of 1
11. (op_5 obj_11 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_12) (pred_5 obj_03 obj_11)
   goals met: 1 of 1
